In [2]:
import pandas as pd
import numpy as np

from IPython.display import display

In [3]:
predaje = pd.read_csv("predaje.csv")

predaje = pd.DataFrame(predaje)
display(predaje)

           X cas_nakupu produkt    cena krajina quartal  kategoria kluc
0          1        Jan  Mlieko   3.000      SK      Q1      Jedlo   BA
1          2        Jan  Tricko  10.000      SK      Q1  Oblecenie   BA
2          3        Jan  Sveter  25.000      SK      Q1  Oblecenie   BA
3          4        Jan  Chlieb   2.000      SK      Q1      Jedlo   BA
4          5        Jan  Mlieko   3.000      SK      Q1      Jedlo   BA
...      ...        ...     ...     ...     ...     ...        ...  ...
74995  14996        Jan  Chlieb   1.480      CZ      Q1      Jedlo   OS
74996  14997        Jan  Mlieko   2.035      CZ      Q1      Jedlo   OS
74997  14998        Jan  Chlieb   1.480      CZ      Q1      Jedlo   OS
74998  14999        Jan  Chlieb   1.480      CZ      Q1      Jedlo   OS
74999  15000        Jan  Chlieb   1.480      CZ      Q1      Jedlo   OS

[75000 rows x 8 columns]

In [19]:
pivot1 = pd.pivot_table(predaje, index=["produkt"],
                        values=["cena"], columns=["krajina"])
display(pivot1)

            cena
krajina       CZ     SK
produkt
Chlieb     1.480    2.0
Laptop   536.500  540.0
Mlieko     2.035    3.0
Mobil    233.100  230.0
Sveter    22.940   25.0
Tablet   340.400  350.0
Tricko     9.250   10.0

In [18]:
pivot2 = pd.pivot_table(predaje, index=["kluc"], values=["cena"],
                        columns=["krajina", "produkt"], observed=True)
display(pivot2)

NaN

          cena                                                                 \
krajina     CZ                                               SK
produkt Chlieb Laptop Mlieko  Mobil Sveter Tablet Tricko Chlieb Laptop Mlieko
kluc
BA         NaN    NaN    NaN    NaN    NaN    NaN    NaN    2.0  540.0    3.0
BR        1.48  536.5  2.035  233.1  22.94  340.4   9.25    NaN    NaN    NaN
KE         NaN    NaN    NaN    NaN    NaN    NaN    NaN    2.0  540.0    3.0
NT         NaN    NaN    NaN    NaN    NaN    NaN    NaN    2.0  540.0    3.0
OS        1.48  536.5  2.035  233.1  22.94  340.4   9.25    NaN    NaN    NaN


krajina
produkt  Mobil Sveter Tablet Tricko
kluc
BA       230.0   25.0  350.0   10.0
BR         NaN    NaN    NaN    NaN
KE       230.0   25.0  350.0   10.0
NT       230.0   25.0  350.0   10.0
OS         NaN    NaN    NaN    NaN

In [35]:
pivot3 = pd.pivot_table(predaje, index=["cas_nakupu"], values=["X"],
                        columns=["krajina", "kategoria", "kluc"], aggfunc=len)

display(pivot3)

                 X                                                             \
krajina         CZ                                     SK
kategoria  Elektro     Jedlo       Oblecenie      Elektro          Jedlo
kluc            BR  OS    BR    OS        BR   OS      BA   KE  NT    BA   KE
cas_nakupu
Apr             41  65  1195   931       140  193      95  148  20  1114  854
Aug             33  72  1225   989       180  214      84  162  22  1236  903
Dec             31  66  1192  1039       180  228      98  136  31  1152  957
Feb             46  74  1097   923       163  188      70  134  24  1056  763
Jan             39  90  1250  1039       186  221      80  159  27  1248  950
Jul             40  91  1244   976       176  214      74  144  26  1197  948
Jun             48  65  1225   994       157  188      99  133  30  1174  898
Maj             38  73  1237   971       144  205      74  162  20  1234  924
Mar             36  72  1227   945       150  222      76  170  29  1151  888
Nov             42  80  1187   980       166  206      75  143  29  1161  841
Okt             43  68  1255   927       180  173      76  172  29  1147  919
Sep             42  71  1214   975       151  172     100  189  18  1150  845


krajina
kategoria       Oblecenie
kluc         NT        BA   KE   NT
cas_nakupu
Apr         705       257  198   88
Aug         693       239  217  100
Dec         726       264  254   87
Feb         688       211  190  121
Jan         731       266  206  114
Jul         742       242  202  107
Jun         668       229  188   89
Maj         720       267  220   84
Mar         756       259  203   93
Nov         681       236  217   88
Okt         714       262  185   99
Sep         693       247  178  108